#Шандронов Эдуард Эрнестович  
**Задание 1.**  
К данному приложению можно применить следующие виды тестирования:  
1)нужно сделать функциональную проверку окна веб-интерфейса, которое доступно для пользователя, методом «черного ящика». В перечень тестов надо провести  позитивные тесты на проверку работы при вводе корректных данных  и негативные тесты на проверку работы при вводе однозначно некорректных данных.  
2)нужно проверить работу этого приложения на всех поддерживаемых платформах (iPhone, Microsoft Windows 11, на браузере Google Chrome и других), т.е. провести кроссплатформенное тестирование.  
3 нужно проверить работу веб-сервера по заданным критериям. Например, провести нефункциональное нагрузочное тестирование, которое определит скорость выполнения запросов и количество запросов, которые способен одновременно выполнить сервер. Провести статический анализ самого кода, выполняющего запросы,  методом «белого ящика».  
4)нужно проверить устойчивость базы к неавторизованным запросам,  качество работы и хранения информации в базе данных.  

**Чек-лист**
!Проверка!	Результат!	Комментарий!
!Окно интерфейса!		
Ввод ФИО в поле «Введите ФИО»		
Ввод цифр в поле «Введите ФИО»		
Ввод даты вида ДД.ММ.ГГГГ в поле «Введите дату рождения»		
Ввод набора букв в поле «Введите дату рождения»		
Проверка расчета возраста при введении корректных данных		
Проверка расчета возраста без введения данных в поля		
Проверка расчета возраста при введении 00.00.0000 в поле «Введите дату рождения»		
Проверка расчета возраста при введении даты позже сегодняшней в поле «Введите дату рождения»		
Проверка расчета возраста при введении сегодняшней даты в поле «Введите дату рождения»		
Проверка расчета возраста при введении даты рождения ребенка, родившегося меньше года назад в поле «Введите дату рождения»		
Проверка расчета возраста при введении даты рождения человека, родившегося более 100 лет назад в поле «Введите дату рождения»		
Проверка работы окна интерфейса в браузере Google Chrome		
Проверка работы окна интерфейса в браузере Mozilla Firefox		
Проверка работы окна интерфейса в браузере Opera		
Проверка работы окна интерфейса на мобильном устройстве iPhone с IOS 13		
Проверка работы окна интерфейса на мобильном устройстве Android		
Сервер		
Проверка работы исполняющего кода		
Нагрузочная проверка работы сервера при одновременном выполнении 10000 запросов		
Проверка скорости выполнения единичного запроса		
База данных		
Проверка сохранения данных о пользователе		
Проверка сохранения системных логов		
Проверка безопасности доступа к данным		


Задание 2.
1)	Select City From Customers

       2)  Select * From Customers
Order by City Desc

3)	Select * from Customers
Where City Like ‘A%’

Задание 3.
1) Для создания каждого ПО  необходимо составить техническое задание (ТЗ), в котором будут описаны характеристики  создаваемого продукта. Баг  это дефект, который появляется при ошибке в написании кода или дизайна продукта.
В процессе тестирования баг выявляется, если в ходе выполнения тест-кейса, составленного в соответствии с техническим заданием, фактический результат не соответствует ожидаемому.
2)Правильный баг-репорт должен включать обязательные атрибуты:
- ID (уникальный идентификатор)
- Тема (краткое описание)
- Подробное писание (Более описание с указанием места и характера ошибки)
- Шаги для воспроизведения 
- Фактический результат
- Ожидаемый результат
- Тестовое окружение
- Серьезность дефекта
- Приоритет дефекта
- Статус
3) К баг-репорту можно также дополнительно приложить лог-файл, видео или скриншот, при помощи которых можно понять как и где допущена ошибка.






